{"pageProps":{"postData":{"id":"nextjs-react-markdown","contentMarkdown":"\r\n# The move to more customizable Markdown\r\n\r\nIf you're using the `remark-html` packages, you'll notice that it is quite limited in its abilty to customize the resulting HTML. `remark-html` only compiles Markdown files into an HTML string with default HTML tags like `<h1>`, `<p>`, or `<code>`. Because it goes straight to a string, you'll have to write code to parse the string in order to utilize custom React components if you do not wish to use the default HTML tags. With the default HTML tags, the customizability of rendered Markdown such as code blocks is quite limited and you can't do complex things with a single `<code>` tag in CSS.\r\n\r\nThis is where `react-markdown` comes in. `react-markdown` converts a Markdown string into React elements instead of an HTML string. This way, you can specify your own React elements instead of the default HTML tags. This allows for much more customization of individual HTML elements such the ability to use a much more stylish code display complete with syntax highlighting via custom React components such as that from the `react-syntax-highlighter` NPM package.\r\n\r\n`react-markdown` also avoids the use of  the `dangerouslySetInnerHTML` feature in React which can potentially cause cross-site scripting (XSS) attacks if used improperly. The `dangerouslySetInnerHTML` function tells React to render an HTML string as actual HTML code without concern for security. `dangerouslySetInnerHTML` is required by `react-markdown`, because `react-markdown` outputs HTML code in a string.\r\n\r\n# Installation and use\r\n\r\n`react-markdown` is available in NPM and can easily be installed by running: \r\n\r\n```bash\r\nnpm install react-markdown\r\n```\r\n\r\nAfterwards, the code below is no longer used. \r\n\r\n```jsx\r\nimport { remark } from 'remark';\r\n\r\n// some code\r\n\r\nconst processedContent = await remark()\r\n  .use(html)\r\n  .process(matterResult.content);\r\nconst contentHtml = processedContent.toString();\r\n\r\n// some more code\r\n\r\n<div dangerouslySetInnerHTML={{ __html: postData.contentHtml }} />\r\n```\r\n\r\nInstead, we'll use : \r\n\r\n```jsx\r\nimport ReactMarkdown from 'react-markdown';\r\n\r\n// some code\r\n\r\n<ReactMarkdown children={matterResult.content} />\r\n```\r\n\r\nThe rendered page should look exactly the same as before but now we have the ability to pass custom React elements to `ReactMarkdown` for a more customized page.","title":"Migrating from remark-html to react-markdown","description":"Upgrading from remark-html to react-markdown for more secure HTML and customizable React components","date":"2022-08-30","publish":true}},"__N_SSG":true}