{"pageProps":{"postData":{"id":"hello-world","contentHtml":"<h1>Summary</h1>\n<p>This post will briefly cover what is \"Hello, World!\" and how this personal site was made.</p>\n<h1>Hello, World!</h1>\n<p>\"Hello, World!\" programs are programs that does nothing except display a message similar to \"Hello, World!\". These programs illustrate a programming language's basic syntax and serve as sanity check to ensure that programs, packages, and/or compilers are installed properly to run a programming language. This page is meant to be more of the latter use case of \"Hello, World!\" programs. While the words on this page was not exactly written in a programming language (it was written in Markdown and rendered using JavaScript), relies on more than just the core facilities JavaScript language to display on a web browser properly, and displays way more than a simple two-worded message, the underlying principles still hold.</p>\n<p>If you are able to read this page on your browser, then that means that the sanity check has passed and that means that all required programs are installed, written, and executed correctly. In addition, the syntax (for Markdown) is illustrated in the .md file for this page, albeit quite excessively given the length of this blog post. Following are the steps I've taken to create this website.</p>\n<h1>Prerequisite</h1>\n<p>NodeJS with NPM - allows running JavaScript code without a browser ; can be installed at https://nodejs.org</p>\n<h1>How to get there (with NextJS)</h1>\n<p>This personal site was created using NextJS and its accompanying tutorial located here: https://nextjs.org/learn/basics/create-nextjs-app. In fact, the very first version of this site that was uploaded to GitHub was the end result of following the tutorial to the letter. The tutorial should result in a web application sporting a home page and two blog posts complete with CSS styling and with infrastructure to easily add more blog posts. By the end of the tutorial, there should be a folder named posts with two .md files. Add more posts here to have them rendered and automatically listed on the home page.</p>\n","title":"Hello, World! (and how to get there)","date":"2022-08-17"}},"__N_SSG":true}